{
    "version": "https://jsonfeed.org/version/1",
    "title": "Oliver Associates",
    "description": "",
    "home_page_url": "https://bill-oliver.github.io/OliverAssociates",
    "feed_url": "https://bill-oliver.github.io/OliverAssociates/feed.json",
    "user_comment": "",
    "author": {
        "name": "bo"
    },
    "items": [
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/reference.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/reference.html",
            "title": "Reference",
            "summary": "HHCC Accession No. 2003.001 HHCC Classification Code: 1.01-2 Last Modified: July 11, 2003 1.01 Unitary Refrig and A/C Equipment and&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.001</strong></th>\n<th><strong>HHCC Classification Code:  1.01-2</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>July 11, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>1.01 Unitary Refrig and A/C Equipment and Systems - Household Cabinet Refrigerators</p>\n<h5 id=\"description\">Description:</h5>\n<p>Five Cubic Foot household, Cabinet Refrigerator With Condensing Unit For Remote Mounting, Kelvinator, Circa 1926</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>C13- 6,7,8,9,10</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8- 6,7,8,9, 1.01-2A</p>\n<h5 id=\"make\">Make:</h5>\n<p>Kelvinator</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Kelvinator of Canada, London Ontario</p>\n<h5 id=\"model\">Model:</h5>\n<p>See Note #1</p>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<p>See Note #2</p>\n<h5 id=\"size\">Size:</h5>\n<p>26x22x54</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>See Note #3</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1927</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Very rare, education, demonstration and research quality</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<p>First Pat. No, 1926, US, Canada and principal foreign countries, including China, with Chinese characters on name plate</p>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. \nThis artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<p>Operating system: compression refrigeration type, theoretical Carnot cycle. \nDesign: unitary design and construction with: insulated refrigerated cabinet, evaporator and expansion valve, and self-contained refrigerant condensing unit, electric motor driven. </p>\n<p>Air-Cooled Condensing Unit, Type: Self-contained condensing unit with belt driven compressor, single-phase electric motor, and air cooled condenser Design: early open design</p>\n<h5 id=\"construction\">Construction:</h5>\n<p>Condensing Unit: Kelvinator condensing unit, ‘bread board style’, assembled on early, wooden, plywood base in natural oiled finish, with belt driven compressor and motor (original 25 cycle motor replaced in 1948 with 60 cycle), finned forced air cooled condenser and steel tank receiver for 2.1 lb. SO2 refrigerant charge. (See Ref. 1.1, P. 82D). Condensing unit is mounted on 6 in. steel legs with natural rubber foot pads for remote (basement) installation, with 1/4 in. liquid and suction line, copper tubing with SAE flare connections. For detailed specifications see Ref. 1.1 P. 82D </p>\n<p>Cabinet: Construction heavy galvanized brake-formed sheet stock,” gauge, wooden cabinet frame and 2 in. cork insulation. See ref 1.1, P. 79D for detailed construction </p>\n<p>Cabinet finished in white “ Pyroxylin “ ,Original paint finish now chipping badly, </p>\n<p>Hardware replaced with 1930’s style hinges and “ice box” style latch Evaporator: in tinned copper plate with copper tubing refrigerant coils, with inner and outer casings with 1” cork insulation, not original with this cabinet</p>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<p>This condensing unit, noisy and dirty, often with the smell of sulphur dioxide was designed for “remote” mounting in the basement of the home, to be reconnected to the refrigerator cabinet with copper tubing</p>\n<h5 id=\"accessories\">Accessories</h5>\n<p>:</p>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<p>Unitary Refrigeration Equipment: The idea of a unitary piece of refrigeration or air conditioning equipment was a significant one in its own right, one that had to wait its time. The scientists, engineers and inventors in the early years of the 20th century were intrigued and obsessed with the power of the technology and of its possible market potential. What they saw was the newly discovered principles of physics and heat engines - following, for example, the early works of Carnot, Faraday, Kelvin, and the later work of Perkins, Larsen and Carrier, to name a few. </p>\n<p>They understood the promise of the technology for the public good, not to say its consumer sales potential. Early engineering work advanced on a multiple fronts with development of compressors, heat exchangers, valves and piping variously strung together in configurations that would be found to work, but only after much experimentation.</p>\n<p>The arrival of unitary equipment, all those parts organised into a single whole, a single unit of construction, a ‘black box’, that could be offered to the consumer market was a significant technological and cultural event. Technologically the refrigerator would need to be seen to be safe, reliable, maintainable and useful. As well, in order to attract the development capital needed, it must be seen as potentially saleable and affordable, contributing to life’s needs and desires. Its socio- cultural and economic significance was marked, for it would change much. As Canadians we would quickly come enjoy potentially healthier lives, expect new levels of comfort and convenience, with a broader, safer, more diverse and enjoyable diet. </p>\n<p>Canadians would quickly come to think of their day differently, for the day would be defined and punctuated in different ways than ever before, as a result of the introduction of modern, electric, household appliances, of which refrigerators, freezers and room air conditioners would be a central part, by the mid 20th century </p>\n<p>J. M Larsen produced a manually operated household refrigerator of sorts in 1913, but it was not until 1918 that the Kelvinator Company marketed the first automatic, unitary refrigerator for the home. In that year, it is reported to have sold sixty-seven machines. (See Note 1) The historic artifacts in Group 1.00, Unitary Equipment, including significant samplings the early work of Kelvinator of Canada, provide a rare view of the evolution of unitary refrigeration and air conditioning applications, as they evolved in Canada in the first half of the 20th century. </p>\n<p>For those formative years, the artifacts in this Group, 1.00,  are typical of the offerings of the Canadian refrigeration and air conditioning industry. They personified the applications found in the homes, farms and commercial premises of the period for, those that could afford life’s new amenities of comfort, convenience and privilege. </p>\n<p>This Specimen: This refrigerator stands as a statement of the earliest, embryonic years of refrigerating technology in Canada. Showing the natural effects of ageing and constant use and repair over its 50 year, active, life span. The condensing unit is in original pristine condition with the exception of the 25 cycle motor replaced at the time of frequency conversion in Ontario in 1948, up to which point the machine had been in constant use. The evaporator is likely not original with this machine, but typical of the brine-tank evaporators used in that period. It was a period in which refrigerators were subject to high maintenance, repair over a long life span.</p>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<p>This specimen tells the stories of the early years of the development of the industry in North America, where the commitment of the Industry was to the inherently noisy, mechanically troubled compression refrigeration cycle, with slow speed, often crudely machined “chunking” compressors, open motor drives and fan cooled “whirring” condensers.</p>\n<p>The marketing of absorption systems, as an alternative, developed by Electrolux in Europe, and licensed to Servel in Evanseville Ind,. would still be several years away.</p>\n<p>The early patent and world-wide registration marks Kelvinator as a pioneer in the field, as well as an aggressive global North American marketer. It had high expectations for industry leadership and domination.</p>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<p>Possibly one of the earliest household, all electric, self-contained, cabinet refrigerators, coming out of a Canadian manufacturing plant, this machine would be part of the genre that would change for ever the way Canadians would think about their kitchens and the food they eat.</p>\n<p>Patent Data: First Pat No. 1920, US, Canada, and principal foreign Countries Extensive list of patents cited, including Chinese characters on name plate, indicative of the international marketing of this product by Kelvinator.</p>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<p>The home of the 1920’s was not at all used to the sound of electric motors, let alone those that went on and off automatically all day and all night too. Kelvinator’s solution in a bid for customer acceptance was this machine with a condensing unit which could be tucked away in the basement out of sight and hopefully out of sound range. </p>\n<p>The”Ice Box Styling”of the cabinet reflects the limited manufacturing methods of the day, but also the natural carryover from the age of the ice box. The electric refrigerator, then, was first imagined as an ice box and configured accordingly.</p>\n<p>The predisposition of the industry to ice box styling, with square corners and hardware would persist for many manufacturers well through the 1930’s (see items 2 and 3). Kelvinator, however, were producing “modern” styled machines by 1934, in a bid for moving the North American mind set beyond the ice box and so to attract first time buyers. </p>\n<p>The significance of the refigeration cabinet lies not in its presence as a restored showpiece of the early years of the industry. But rather, with its original finish, showing the effects of the many years of natural wear and tear, its significance is in its demonstrated antiquity and the many stories it tells of the years gone by.</p>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<p>Bibliograhic Note #1 Ref. Modern Refrigeration and Air Conditioning, Althouse and Turnquist, Goodheart-Wilcox Co. Chicago, 1960</p>\n<h5 id=\"notes\">Notes:</h5>\n<p>Note #1: Kelvinator Condensing Unit Part No. 12800, Serial 2532C\nNote #2: Kelvinator Cabinet and part no. unmarked. Likely part of their “5 1/2 and 9 cu. ft.” series built in the early to mid 1920’s (See Ref. 1.3, P.54), similar to model 227 (See Ref. 1.1, P. 79D)\nNote #3: Wt condensing Unit 80 lbs, Cabinet ? lbs,</p>\n<h5 id=\"related-reports\">Related Reports</h5>\n<p>:\nSee Thumb-Nail Profile, THOC doc. OC9908B</p>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/2.02-4.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/2.02-4.html",
            "title": "2.02-4",
            "summary": "HHCC Accession No. 2003.024 HHCC Classification Code: 2.02-4 Last Modified: Sept. 18, 2003 2.02 Refrigerating and Air Conditioning Evaporators -&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.024</strong></th>\n<th><strong>HHCC Classification Code:  2.02-4</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Sept. 18, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>2.02 Refrigerating and Air Conditioning Evaporators - Commercial</p>\n<h5 id=\"description\">Description:</h5>\n<p>Four tray, ice maker evaporator with low-side float, using an early form of modular construction, in tinned copper tube and brake formed copper sheet. Cooling unit with gleaming porcelain tray pulls, for small commercial cabinet refrigerator, similar to #022, #023  Frigidaire, 1926</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>C15-26</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8-100</p>\n<h5 id=\"make\">Make:</h5>\n<p>Frigidaire</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Frigidaire Division, General Motors Corp.,Dayton Ohio</p>\n<h5 id=\"model\">Model:</h5>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<p>Float #9683</p>\n<h5 id=\"size\">Size:</h5>\n<p>11x 10x 18’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>38 lbs</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1926, (Frigidaire Manual  SER-405, shows product as discontinued in 1928)</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, demonstration, education and research quality</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, commercial and consumer technology. </p>\n<p>This evaporator carries with it the original T. H. Oliver service tag dated January 3, 1954, marked ‘ needs further flushing and sealing’</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<p>Flooded evaporator with low-side float in tinned copper tube and brake formed copper sheet, similar to #022, #023</p>\n<h5 id=\"construction\">Construction:</h5>\n<p>Constructed in tinned, heavy copper plate, with 5’ dia., 14 inch, brass float chamber, with brass, flange mounted float assembly, calibrated for S02 refrigerant; 5 pass, 1/2’ copper distributing tubes, without side box fin, recessed suction and liquid line shut off valves with gas tight caps. The heavy construction throughout marks the respect which the manufacturer held for SO2 refrigerant, its noxious and corrosive properties.</p>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<p>The early form of modular construction employed allowed the manufacturer to ‘grow’ their evaporators using standard off the shelf components, with relatively predictable performance.</p>\n<h5 id=\"accessories\">Accessories</h5>\n<p>Heavy 4  point hanger system in double dip galvanised strap iron</p>\n<h5 id=\"capacities\">Capacities:</h5>\n<p>An ice making evaporator with 4 tray ice making capacity, employs a clever double tray module that converts to frozen food storage, or to ice making with the inclusion of a sliding shelf</p>\n<p>Frigidaire’s manual SER-45,  Chapter 1A, P. 25, suggests such evaporators were rated at about 10 lbs of ice per freezing and required about 6 lbs of SO2 refrigerant to flood the evaporator, sufficient to clear the household and the neighbourhood, if a serious leak occurred</p>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<p>The original T. H. Oliver service tag dated January 3, 1954, marked ‘ needs further flushing and sealing’, is an indicator of the times and the long performance life, which was built in to this technology. Some 30 years after it first appeared on the market it had been repaired and ready for re-application.</p>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<p>Liquid refrigerant float operated metering device</p>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<p>Small commercial food stores, large private estate and institutional use</p>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<p>See background notes on technological significance of early mechanical cooling units (evaporator), THOC-HVACR inventory item 011.</p>\n<p>This specimen is representative of the proliferation of models and sizes of low-side float operated evaporators of the period, largely by Kelvinator and Figidaire, as they attempted to stretch this ice making technology to its limit. Dinosaur like, costly, complicated and trouble prone by comparison with the evaporator technologies that would shortly follow, this genre would largely disappear from manufacture’s catalogues by the early 1930’s, although would be operational in the field until after WWII ‘ requiring repair shops to rebuild an calibrate floats and needle seats. </p>\n<p>To contrast the weight, size, seeming complexity, as well as materials and manufacturing costs with the technology reflected in inventory items 015 to 021 is instructive. The classic process of progressive simplification in technological innovation and change is well exemplified.</p>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<p>With complex, demanding construction, the evaporator would make many demands on manufacturing and materials engineering in the early years of the 20th century.</p>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<p>Frigidaire Installation and service manual SER-45</p>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/4.01-3.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/4.01-3.html",
            "title": "4.01-3",
            "summary": "HHCC Accession No. 2003.031 HHCC Classification Code: 4.01-3 Last Modified: Oct 28, 2003 4.01 Refrigerating and Air Conditioning Condensing Units&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.031</strong></th>\n<th><strong>HHCC Classification Code:  4.01-3</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Oct 28, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>4.01 Refrigerating and Air Conditioning Condensing Units - Household</p>\n<h5 id=\"description\">Description:</h5>\n<p>A medium duty, second generation, coil spring mounted medium speed, condensing unit with belt driven, single cylinder, reciprocating compressor, copper tube and finned, two  pass air cooled condenser, with 1/4th HP electric motor. A refrigerating machine for the large Canadian estate home, or family food store application. Like #030, it came with a new sense of quiet that would be characteristic of the best of the industry’s offerings in the early growth years of the household refrigerator in Canada. Designed and manufactured by an acknowledged market leader of the times with facilities in London Ontario, Kelvinator, 1932.</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>C13-19</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8-19</p>\n<h5 id=\"make\">Make:</h5>\n<p>Kelvinator</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Kelvinator of Canada, London Ontario</p>\n<h5 id=\"model\">Model:</h5>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<h5 id=\"size\">Size:</h5>\n<p>16x 14x 12’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>80 lbs</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1932</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, education, and research quality demonstrating the early growth years of  refrigeration machines [condensing units] for large estate homes, produced by an acknowledged leader in Canadian design  and production.</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology. </p>\n<p>This machine, with its liquid receiver removed, was used by T.H. Oliver Refrigeration as a vacuum pump in his shop throughout the 1950’s and 60’s - attesting to the remarkable long operating life built into the equipment.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<h5 id=\"construction\">Construction:</h5>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<h5 id=\"accessories\">Accessories</h5>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<p>A significant marker of a new level of quiet and smooth operation for refrigerating machines of the time, to be tolerated in the kitchens of the nation</p>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<p>Helped to establish London and Western Ontario as a major hotbed of manufacturing practice in refrigeration and appliance production.</p>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/2.02-7B.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/2.02-7B.html",
            "title": "2.02-7B",
            "summary": "HHCC Accession No. 2003.028 HHCC Classification Code: 2.02-7B Last Modified: Oct. 27, 2003 2.02 Refrigerating and Air Conditioning Evaporators -&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.028</strong></th>\n<th><strong>HHCC Classification Code:  2.02-7B</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Oct. 27, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>2.02 Refrigerating and Air Conditioning Evaporators - Commercial</p>\n<h5 id=\"description\">Description:</h5>\n<p>Early, heavy copper tube and fin static evaporator with double dip galvanised coating for large ‘walk-in’ refrigerated room, equipped with low-side float and suction line chamber, for low pressure SO2 refrigerant, Frigidaire, Circa 1926</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>C15-23</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8-97</p>\n<h5 id=\"make\">Make:</h5>\n<p>Frigidaire</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Frigidaire</p>\n<h5 id=\"model\">Model:</h5>\n<p>Likely model 560 or 570, See Frigidaire Manual ,SER.-405</p>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<h5 id=\"size\">Size:</h5>\n<p>11x 67x 6’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>90 lbs</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1926, the Frigidaire Manual SER 405, P27, chapter1-A, indicates this product was discontinued in 1928</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, education and research quality, exemplifying early 20th century evaporator design</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<p>Static fin coiling produced on a scale not now seen was a feature of the day. Equipped with low side float refrigerant control, a temperamental flow control technology, yet one well developed for the needs of the period., using the same float designs as appeared on Frigidaires ice maker evaporators , see artifact #025, for example</p>\n<h5 id=\"construction\">Construction:</h5>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<p>Matching set of two coils typically used in tandem</p>\n<h5 id=\"accessories\">Accessories</h5>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<p>Refrigerated storage rooms for perishable foods were designed predominantly for high pressure refrigerant, commonly ammonia, in the early years of the 20th century. With the successful entry of lower pressure refrigerants, notably SO2, into the market place, the market was significantly expanded, opening it up to smaller commercial installations, which did not require operating engineers. Food stores, dairies and refrigerated warehouses would welcome the trend. So to the public who would see on the market a whole new range of foods for their health and enjoyment.</p>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<p>Frigidaire manual SER,-405</p>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/4.01-5.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/4.01-5.html",
            "title": "4.01-5",
            "summary": "HHCC Accession No. 2003.033 HHCC Classification Code: 4.01-5 Last Modified: Oct. 29, 2003 4.01 Refrigerating and Air Conditioning Condensing Units&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.033</strong></th>\n<th><strong>HHCC Classification Code:  4.01-5</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Oct. 29, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>4.01 Refrigerating and Air Conditioning Condensing Units - Household</p>\n<h5 id=\"description\">Description:</h5>\n<p>Refrigerating machinery by this manufacturer, a uniquely and distinctively Canadian company, made a special contribution to Canada’s material culture of refrigerating technology. The Gilson Manufacturing Co. of Quelph Ontario was part of the new industrialism growing up in the Ontario hinterlands, between the Wars,  to service the needs of rural Ontario, much less than the provinces urban elites.  </p>\n<p>Executed in the company’s distinctive aqua , blue/green, tones it would be a well recognised part of the Canadian refrigeration landscape through the middle years of the 20th century - seen by many as its ‘golden’ years. A condensing unit with belt driven, single cylinder, reciprocating compressor, copper tube and finned, single pass air cooled condenser, and 1/6th HP electric motor, it  was assembled on  a distinctive cast iron, foundry produced frame, a hallmark of much Gilson’s production of the period, Gilson Mfg. Co, Circa 1945</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>C13-20</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8-20</p>\n<h5 id=\"make\">Make:</h5>\n<p>Gilson</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Gilson Manufacturing Co, Quelph Ontario</p>\n<h5 id=\"model\">Model:</h5>\n<p>A2MA</p>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<p>C567</p>\n<h5 id=\"size\">Size:</h5>\n<p>18x 16x 14’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>90 lbs</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1945</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, education, and research quality demonstrating the distinctive contribution of a uniquely and distinctively Canadian manufacturer of refrigeration machinery through the middle years of the 20th century</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<h5 id=\"construction\">Construction:</h5>\n<p>The production and construction techniques employed by Gilson admirably demonstrate those of the period. It was a period in which many small manufacturers of refrigeration condensing units were ‘assemblers’, rather than manufacturers in any other sense. Here component parts, mostly purchased from component OEM’s were assembled on frames of local manufacture, tested and launched.</p>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<h5 id=\"accessories\">Accessories</h5>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<p>Gilson employed these condensing units on their own line of household refrigerators as well as on home freezers, among other small refrigeration applications.</p>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<p>One of an early breed of Canadian made condensing units [along with Kelvinator of Canada, and Universal Cooler} moving from the use of highly noxious SO2 to methyl chloride, heralding the massive swing to the chlorinated hydrocarbon refrigerants by the end of the decade (F12).</p>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<p>The assembly process employed, in the years before more sophisticated hermetically sealed condensing units became popular, allowed small, start-up manufactures to get into a growth market with relatively small capital investment and know-how. This would have a profound effect on the speciality companies such as Kelvinator and Frigidaire , who manufactured a full line of component parts and backed much of the research on which the rest of industry relied.</p>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<p>The Gilson Manufacturing Co. were a much trusted supplier to the rural Ontario market, a substantal one in the early and middle years of the 20th century. Their products were sold by the local farm equipment dealers, for example, bring the benefits of refrigeration technology to a first time buyers. Many in the market would not be at all accustomed to the luxuries of 20th century living</p>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/4.01-6A.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/4.01-6A.html",
            "title": "4.01-6A",
            "summary": "HHCC Accession No. 2003.034 HHCC Classification Code: 4.01-6A Last Modified: Oct. 20,2003 4.01 Refrigerating and Air Conditioning Condensing Units -&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.034</strong></th>\n<th><strong>HHCC Classification Code:  4.01-6A</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Oct. 20,2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>4.01 Refrigerating and Air Conditioning Condensing Units - Household</p>\n<h5 id=\"description\">Description:</h5>\n<p>A ‘high tech’ refrigerating machine of the mid 1930’s, the ‘Norge Rollator’ was a precursor of profound change in the technology offerings of the Canadian refrigeration industry. By making use of the best engineering knowledge of the times, this innovative machine both responded to public desire for a less crude mechanical monster in the kitchens of the nation, and at the same time built further expectations for what was to soon come. It was a whole new design concept, by a new generation of world class engineering companies who had entered the now rapidly expanding North American home appliance market, the Borg Warner Corporation of Sweden, Norge Division, Borg-Warner Corp. Detroit Mich, 1935.</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>C13-22</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8-22</p>\n<h5 id=\"make\">Make:</h5>\n<p>Norge</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Borg-Warner Corp. Detroit, Mich</p>\n<h5 id=\"model\">Model:</h5>\n<p>S4237</p>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<p>4711231</p>\n<h5 id=\"size\">Size:</h5>\n<p>20x 18x 12’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>90 lbs</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1935</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, education, and research quality demonstrating a significant benchmarks in the evolution of refrigeration machinery employed in the Canadian home ‘ a major achievement in what would be an on-going search for quieter, smoother operating refrigeration condensing unit</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<p>A wonderfully quiet new generation of refrigeration machines, with coil spring suspension and smoothly operating, belt driven, medium speed rotary compressor, the ‘Norge Rollator’. Suddenly gone was the chunk-chunk of the piston operating refrigeration compressor. </p>\n<p>Designed for installation in the Norge cabinet refrigerator, the machine is equipped with a large copper tube and finned, single pass air cooled condenser, large SO2 refrigerant receiver, and resilient mounted 1/6th HP electric motor. The machine was mounted on a sound and vibration absorbing, five ply, plywood base, itself a significant marker of technological achievement and the changing times. It was a whole new design concept, by a new generation of world class engineering companies who had entered the rapidly expanding North American home appliance market, the Borg Warner Corporation of Sweden, Norge Division, Borg-Warner Corp. Detroit Mich, 1945.</p>\n<h5 id=\"construction\">Construction:</h5>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<h5 id=\"accessories\">Accessories</h5>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<p>The high end market, for many it would be a second refrigerator moving up from earlier less consumer friendly machines</p>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<p>It was a whole new design concept, by a new generation of world class engineering companies who had entered the rapidly expanding North American home appliance market, the Borg Warner Corporation of Sweden, Norge Division, Borg-Warner Corp. Detroit Mich, 1945.</p>\n<p>What was signalled here was the end of the refrigeration condensing unit as a mere assemblage by mere assemblers of parts based, variously, on a range of buy- make decisions appropriate for the market conditions of the moment [See for example #033].\nThe commitment of the industry would be increasingly to specialised compressor design and to smoothly integrated systems applying state of the art systems thinking [See for example #036.</p>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<p>Of significance in the Canadian industrial context is the Rogers connection with leading edge innovations in the refrigeration field.  </p>\n<p>Toronto based Rogers-Majestic, by 1928, was the largest manufacturers of radio broadcast receivers in Canada, enjoying the market boom of the times. The Rogers empire was founded on innovative the work of Edward S. Rogers, who received a Dominion of Canada patent for a ‘rectifying system’ on June 16, 1925. By August of that year Rogers was in mass production of the worlds first practical AC radio tube and the first Rogers Batteryless radio broadcast receiver. </p>\n<p>By the early 1930’s the company was looking to expand and consolidate its reputation for technological innovation and market leader. Rogers acquired the rights to Norge name in the early to mid 1930’s to further establish themselves as Canadian leaders in the rapidly growing field of household, consumer technology [See advertisement in ‘Radio Trade Builder’, March 1935]       </p>\n<p>This international partnership arrangement would also represent a model for much of what was to come. Much in the Canadian HVACR industry would come as a consequence of corporate arrangements of convenience between Canadian and international manufacturers and suppliers to the Canadian HVACR field.</p>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<p>‘A Compleat Retrospective, Spanning the Years’, Ian Anthony, Corporate Historian, Rogers Telecommunications Incorp.</p>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/4.02-1.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/4.02-1.html",
            "title": "4.02-1",
            "summary": "HHCC Accession No. 2003.040 HHCC Classification Code: 4.02-1 Last Modified: Nov. 5, 2003 4.02 Refrigerating and Air Conditioning Condensing Units&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.040</strong></th>\n<th><strong>HHCC Classification Code:  4.02-1</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Nov. 5, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>4.02 Refrigerating and Air Conditioning Condensing Units - Commercial</p>\n<h5 id=\"description\">Description:</h5>\n<p>An early, commercial application, air-cooled, refrigeration machine [condensing unit] by Kelvinator of Canada designed for use with anhydrous, sulphur dioxide. an early refrigerant that made possible, for the first time, small commercial refrigeration applications in food stores etc. The use of low pressure refrigerants, rather than high pressure anhydrous ammonia, opened up a vast commercial market for refrigeration equipment and, in turn, set new expectations by Canadian consumers of what was available at their local grocer and butcher shop, Kelvinator, circa 1932.</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>CD 13-25</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8-25</p>\n<h5 id=\"make\">Make:</h5>\n<p>Kelvinator</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Kelvinator of Canada</p>\n<h5 id=\"model\">Model:</h5>\n<p>Unknown, Compressor Body No. 3147</p>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<p>Unknown</p>\n<h5 id=\"size\">Size:</h5>\n<p>23x 17x 21’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>120 lbs</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1932</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, education, and research quality demonstrating the early form and working of a small commercial application refrigeration machine in Canada, designed for low pressure refrigerants, here sulphur dioxide [S02}</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<h5 id=\"construction\">Construction:</h5>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<h5 id=\"accessories\">Accessories</h5>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/4.02-4.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/4.02-4.html",
            "title": "4.02-4",
            "summary": "HHCC Accession No. 2003.043 HHCC Classification Code: 4.02-4 Last Modified: Nov 10, 2003 4.02 Refrigerating and Air Conditioning Condensing Units&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.043</strong></th>\n<th><strong>HHCC Classification Code:  4.02-4</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Nov 10, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>4.02 Refrigerating and Air Conditioning Condensing Units - Commercial</p>\n<h5 id=\"description\">Description:</h5>\n<p>Like Item #042, this series refrigeration machines, designed for the new generation of chlorinated hydrocarbon refrigerants, was developed by Kelvinator in the post WWII years, for small and medium sized commercial refrigeration applications. The Kelvinator SB medium speed, precision made, high efficiency, open system compressor  would become a standard of engineering quality for the times . The machine, like #042, would  in retrospect, be seen as part of the Kelvinator of Canada legacy of its mature corporate years in Canada, Kelvinator circa 1945.</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>CD 13-37</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8-37</p>\n<h5 id=\"make\">Make:</h5>\n<p>Kelvinator</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Kelvinator of Canada</p>\n<h5 id=\"model\">Model:</h5>\n<p>Part No. 708907</p>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<p>H3203</p>\n<h5 id=\"size\">Size:</h5>\n<p>19x 18x 12’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>125 lbs</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1945</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, education, and research quality demonstrating the best of Canadian refrigeration design and development, associated with the immediate post WWII years in Canada, as the industry responded to a then rapidly developing market for larger commercial, refrigeration applications, including walk-in refrigerated rooms and refrigerated food store fixtures.</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<h5 id=\"construction\">Construction:</h5>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<h5 id=\"accessories\">Accessories</h5>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<p>As the industry responded to a then rapidly developing market for larger commercial, refrigeration applications, including walk-in refrigerated rooms and refrigerated food store fixtures, so too would the food culture of the Country quickly begin to change, with new expectations of the range and quality of perishable foods, often accompanied with new, novel taste sensations, to be found at the local grocer, confectionery and butcher shop.</p>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/4.01-7B.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/4.01-7B.html",
            "title": "4.01-7B",
            "summary": "HHCC Accession No. 2003.038 HHCC Classification Code: 4.01-7B Last Modified: Nov. 3, 2003 4.01 Refrigerating and Air Conditioning Condensing Units&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.038</strong></th>\n<th><strong>HHCC Classification Code:  4.01-7B</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Nov. 3, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>4.01 Refrigerating and Air Conditioning Condensing Units - Household</p>\n<h5 id=\"description\">Description:</h5>\n<p>A later adaptation of the Sunbeam Electric’s, advanced, integrated, open system refrigeration technology, demonstrated in #037, this machine illustrates the market that the technology was able to command over half a decade or more later. Originally engineered for SO2 refrigerant, with an advanced evaporator design in formed and rolled stainless steel, this unit was further up-dated by Howard Oliver, probably in the latter 1940’s, converting it to less toxic methyl chloride refrigerant - the Sunbeam Electric Mfd. Co., Evansville Ind., 1945</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>CD 15-17,18,19,20</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD 8-91,92,93,94</p>\n<h5 id=\"make\">Make:</h5>\n<p>Sunbeam</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>The Sunbeam Electric Mfd. Co., Evansville Ind.</p>\n<h5 id=\"model\">Model:</h5>\n<p>dual name plates carry different identification data\nModel SA23\nModel 106</p>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<p>1130590-25\n19401</p>\n<h5 id=\"size\">Size:</h5>\n<p>22x 18x 23’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>110 lbs.</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1945</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, education, and research quality demonstrating the advances made in integrated, open, refrigeration systems technology by the mid early 1940’s, even then being by-passed by new, sealed system, hermetic designs.</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<p>1718535 (1930): 1732039 (1930); 1812743 (1932); 1894943 (1933); 20322976 (1937)</p>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<p>Direct drive, rotary compressor with copper tube and fin single pass air-cooled condenser mounted on insulated bulkhead forming the top of the refrigerated cabinet. Fully formed and rolled stainless steel, evaporator with refrigerated shelf, equipped with closed back, hinged door, for low temperature operation, and automatic expansion valve</p>\n<h5 id=\"construction\">Construction:</h5>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<p>A-P automatic expansion valve made in Cooksville Ontario, Model AP207C, a high-tech, miniature valve of the period made for a new generation of chlorinated hydrocarbon refrigerants</p>\n<h5 id=\"accessories\">Accessories</h5>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<p>Stands as a significant marker in the evolution of cabinet refrigeration systems working towards highly integrated specialised systems, which would increasingly be the norm in the latter part of the century. The so called ‘hermetic’ system with electric motor and compressor sealed in a single shell were already being marketed by Kelvinator and Frigidaire</p>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        },
        {
            "id": "https://bill-oliver.github.io/OliverAssociates/4.01-6B.html",
            "url": "https://bill-oliver.github.io/OliverAssociates/4.01-6B.html",
            "title": "4.01-6B",
            "summary": "HHCC Accession No. 2003.035 HHCC Classification Code: 4.01-6B Last Modified: Nov. 3, 2003 4.01 Refrigerating and Air Conditioning Condensing Units&hellip;",
            "content_html": "<table>\n<thead>\n<tr>\n<th><strong>HHCC Accession No. 2003.035</strong></th>\n<th><strong>HHCC Classification Code:  4.01-6B</strong></th>\n</tr>\n</thead>\n</table>\n<h5 id=\"last-modified\">Last Modified:</h5>\n<p>Nov. 3, 2003</p>\n<h5 id=\"group\">Group:</h5>\n<p>4.01 Refrigerating and Air Conditioning Condensing Units - Household</p>\n<h5 id=\"description\">Description:</h5>\n<p>As in the case of #034 this is a  ‘high tech’ refrigerating machine of the mid 1930’s, a precursor of profound change in the technology offerings of the Canadian refrigeration industry. It was a whole new design concept, by a new generation of world class engineering companies who had entered the now rapidly expanding North American home appliance market, the Borg Warner Corporation of Sweden, Norge Division, Borg-Warner Corp. Detroit Mich, 1935. A special marker [See electric motor] of the momentous times through which this machine operated is the story it tells of Ontario’s now almost forgotten mega project of the late 1940’s, the conversion of the province from 25 to 60 cycle power.</p>\n<h5 id=\"film-image\">Film Image:</h5>\n<p>C13-23</p>\n<h5 id=\"digital-image\">Digital Image:</h5>\n<p>CD8-23</p>\n<h5 id=\"make\">Make:</h5>\n<p>Norge</p>\n<h5 id=\"manufacturer\">Manufacturer:</h5>\n<p>Borg-Warner Corp. Detroit, Mich</p>\n<h5 id=\"model\">Model:</h5>\n<p>S518</p>\n<h5 id=\"serial-no\">Serial No.:</h5>\n<p>581281</p>\n<h5 id=\"size\">Size:</h5>\n<p>20x 18x 12’h</p>\n<h5 id=\"weight\">Weight:</h5>\n<p>90 lbs</p>\n<h5 id=\"circa\">Circa:</h5>\n<p>1935</p>\n<h5 id=\"rating\">Rating:</h5>\n<p>Exhibit, education, and research quality demonstrating a significant benchmarks in the evolution of refrigeration machinery employed in the Canadian home ‘ a major achievement in what would be an on-going search for quieter, smoother operating refrigeration condensing unit</p>\n<h5 id=\"patent-datenumber\">Patent Date/Number:</h5>\n<h5 id=\"provenance\">Provenance:</h5>\n<p>From York County (York Region) Ontario, once a rich agricultural hinterlands, attracting early settlement in the last years of the 18th century. Located on the north slopes of the Oak Ridges Moraine, within 20 miles of Toronto, the County would also attract early ex-urban development, to be come a wealthy market place for the emerging household and consumer technologies of the early and mid 20th century. </p>\n<p>This artifact was discovered in the 1950’s in the used stock of T. H. Oliver, Refrigeration and Electric Sales and Service, Aurora, Ontario, an early worker in the field of agricultural, industrial and consumer technology.</p>\n<h5 id=\"type-and-design\">Type and Design:</h5>\n<p>A wonderfully quiet new generation of refrigeration machines, with coil spring suspension and smoothly operating, belt driven, medium speed rotary compressor, the ‘Norge Rollator’. Suddenly gone was the chunk-chunk of the piston operating refrigeration compressor. </p>\n<p>Designed for installation in the Norge cabinet refrigerator, the machine is equipped with a large copper tube and finned, single pass air cooled condenser, large SO2 refrigerant receiver, and resilient mounted 1/6th HP electric motor. The machine was mounted on a sound and vibration absorbing, five ply, plywood base, itself a significant marker of technological achievement and the changing times. It was a whole new design concept, by a new generation of world class engineering companies who had entered the rapidly expanding North American home appliance market, the Borg Warner Corporation of Sweden, Norge Division, Borg-Warner Corp. Detroit Mich, 1945.</p>\n<h5 id=\"construction\">Construction:</h5>\n<h5 id=\"material\">Material:</h5>\n<h5 id=\"special-features\">Special Features:</h5>\n<h5 id=\"accessories\">Accessories</h5>\n<h5 id=\"capacities\">Capacities:</h5>\n<h5 id=\"performance-characteristics\">Performance Characteristics:</h5>\n<h5 id=\"operation\">Operation:</h5>\n<h5 id=\"control-and-regulation\">Control and Regulation:</h5>\n<h5 id=\"targeted-market-segment\">Targeted Market Segment:</h5>\n<p>The high end market, for many it would be a second refrigerator moving up from earlier less consumer friendly machines</p>\n<h5 id=\"consumer-acceptance\">Consumer Acceptance:</h5>\n<h5 id=\"merchandising\">Merchandising:</h5>\n<h5 id=\"market-price\">Market Price:</h5>\n<h5 id=\"technological-significance\">Technological Significance:</h5>\n<p>It was a whole new design concept, by a new generation of world class engineering companies who had entered the rapidly expanding North American home appliance market, the Borg Warner Corporation of Sweden, Norge Division, Borg-Warner Corp. Detroit Mich, 1945.</p>\n<p>What was signalled here was the end of the refrigeration condensing unit as a mere assemblage by mere assemblers of parts based, variously, on a range of buy- make decisions appropriate for the market conditions of the moment [See for example #033].\nThe commitment of the industry would be increasingly to specialised compressor design and to smoothly integrated systems applying state of the art systems thinking [See for example #036.    </p>\n<p>This artifact of the early years of the Canadian HVACR industry has special significance as historic marker. I t is driven by a GE motor carrying Ontario Hydro Electric’s name plate and specification data. The conversion of the Province from 25 to 60 cycle was a mega project of unprecedented size and complexity, before or since. It involved among other things the Hydro authority working closely with Canadian motor manufacturers and rewind shops to produce the specialised motors needed, of which this remains a prime example and historic artifact of this momentous period in Canadian technological development</p>\n<h5 id=\"industrial-significance\">Industrial Significance:</h5>\n<p>Of significance in the Canadian industrial context is the Rogers connection with leading edge innovations in the refrigeration field.  </p>\n<p>Toronto based Rogers-Majestic, by 1928, was the largest manufacturers of radio broadcast receivers in Canada, enjoying the market boom of the times. The Rogers empire was founded on innovative the work of Edward S. Rogers, who received a Dominion of Canada patent for a ‘rectifying system’ on June 16, 1925. By August of that year Rogers was in mass production of the worlds first practical AC radio tube and the first Rogers Batteryless radio broadcast receiver. </p>\n<p>By the early 1930’s the company was looking to expand and consolidate its reputation for technological innovation and market leader. Rogers acquired the rights to Norge name in the early to mid 1930’s to further establish themselves as Canadian leaders in the rapidly growing field of household, consumer technology [See advertisement in ‘Radio Trade Builder’, March 1935]       </p>\n<p>This international partnership arrangement would also represent a model for much of what was to come. Much in the Canadian HVACR industry would come as a consequence of corporate arrangements of convenience between Canadian and international manufacturers and suppliers to the Canadian HVACR field.</p>\n<h5 id=\"socio-economic-significance\">Socio-economic Significance:</h5>\n<h5 id=\"socio-cultural-significance\">Socio-cultural Significance:</h5>\n<h5 id=\"donor\">Donor:</h5>\n<p>G. Leslie Oliver, The T. H. Oliver HVACR Collection</p>\n<h5 id=\"hhcc-storage-location\">HHCC Storage Location:</h5>\n<h5 id=\"tracking\">Tracking:</h5>\n<h5 id=\"bibliographic-references\">Bibliographic References:</h5>\n<p>‘A Compleat Retrospective, Spanning the Years’, Ian Anthony, Corporate Historian, Rogers Telecommunications Incorp.</p>\n<h5 id=\"notes\">Notes:</h5>\n<h5 id=\"related-reports\">Related Reports</h5>\n",
            "author": {
                "name": "bo"
            },
            "tags": [
            ],
            "date_published": "2023-05-15T14:11:34-04:00",
            "date_modified": "2023-05-15T14:11:34-04:00"
        }
    ]
}
